// 灵枢织造箱生产组数据
window.LINGSHU_GROUPS = [
  {
    group: "树枝类",// 组名
    priority: 1,// 优先级
    inputs: [// 生产原料
      "多枝树-矮小（1）",
      "多枝树-中等（2）",
      "多枝树-高大（3）",
      "多枝树-年老（1）",
      "多枝树苗（0.5）",
      "",
      "树苗（1）",
      "月亮树苗（1.5）"
    ],
    outputs: [// 生产结果
      "树枝（10）",
      "木头（3）",
      "木板（2）",
      "树苗（1）",
      "月亮树苗（1）"
    ]
  },

  {
    group: "木材类",
    priority: 4,
    inputs: [
        "常青树-矮小（2）",
        "常青树-中等（3）",
        "常青树-高大（4）",
        "常青树-年老（2）",
        "常青树苗（1）",
        "",
        "臃肿常青树-矮小（1）",
        "臃肿常青树-中等（1.5）",
        "臃肿常青树-高大（2）",
        "臃肿常青树苗（0.25）",
        "",
        "桦栗树-矮小（1）",
        "桦栗树-中等（2）",
        "桦栗树-高大（3）",
        "桦栗树苗（0.5）",
        "",
        "月树-矮小（2）",
        "月树-中等（3）",
        "月树-高大（4.5）",
        "月树苗（1.5）",
        "",
        "针刺树（1）",
    ],
    outputs: [
        "木头（5）",
        "木板（2）",
        "树枝（1）",
        "活木（0.5）",
        "浮木（0.25）",
    ]
  },

  {
    group: "棕榈类",
    priority: 10,
    inputs: [
        "棕榈松果树-矮小（1）",
        "棕榈松果树-中等（2）",
        "棕榈松果树-高大（3）",
        "棕榈松果树苗（0.5）",
    ],
    outputs: [
        "木头（4）",
        "棕榈松果树鳞片（3）",
        "香蕉（1）",
        "棕榈松果树芽（1）",
        "树枝（1）",
    ]
  },

  {
    group: "草类",
    priority: 2,
    inputs: [
        "草（1）",
        "",
        "芦苇（3）",
        "猴尾草（4）",
    ],
    outputs: [
        "草（10）",
        "芦苇（3）",
        "草丛（1）",
        "猴尾草（0.5）",
        "莎草纸（0.25）",
    ]
  },

  {
    group: "浆果类",
    priority: 3,
    inputs: [
        "浆果丛（1）",
        "三叶浆果丛（1）",
        "多汁浆果丛（1.5）",
    ],
    outputs: [
        "浆果（10）",
        "多汁浆果（7）",
        "熟浆果（2）",
        "熟多汁浆果（1）",
        "无花果（1）",
    ]
  },

  {
    group: "香蕉类",
    priority: 5,
    inputs: [
        "香蕉丛（2）",
        "洞穴香蕉树（4）",
    ],
    outputs: [
        "香蕉（10）",
        "熟香蕉（3）",
        "香蕉冻（2）",
        "香蕉丛（0.5）",
        "洞穴香蕉杆(hmr)（0.2）",
    ]
  },

  {
    group: "石果类",
    priority: 6,
    inputs: [
        "石果灌木丛（2）",
    ],
    outputs: [
        "石果（10）",
        "成熟石果（3）",
        "石头（2）",
        "熟石果（1）",
        "发芽的石果（0.2)",
    ]
  },

  {
    group: "岩石类",
    priority: 6,
    inputs: [
        "硝矿岩石（1）",
        "金矿岩石（2）",
        "石矿岩石-高（2）",
        "石矿岩石-中（1）",
        "石矿岩石-低（0.25）",
        "",
        "巨石枝（3）",
        "",
        "月岩矿岩石（4）",
        "可疑的岩石（8）",
        "",
        "石笋-高大（5）",
        "石笋-中等（3）",
        "石笋-矮小（1）",
        "石笋柱-高大（5）",
        "石笋柱-中等（3）",
        "石笋柱-矮小（1）",
        "",
        "落石岩石（2）",
        "",
        "石虾（4）",
    ],
    outputs: [
        "石头（10）",
        "燧石（8）",
        "硝石（6）",
        "金块（6）",
        "月岩（2）",
    ]
  },

  {
    group: "大理石类",
    priority: 7,
    inputs: [
        "大理石树（2）",
        "大理石柱（2.5）",
        "麦斯威尔雕像（4）",
        "大理石雕像（2.5）",
        "开裂的柱子（6）",
        "试金石（7）",
        "",
        "大理石灌木-高大（1.25）",
        "大理石灌木-中等（0.75）",
        "大理石灌木-矮小（0.5）",
        "",
        "巨石枝（2）",
    ],
    outputs: [
        "大理石（10）",
        "石砖（3）",
        "石头（3）",
        "大理石豆（2）",
        "萌芽石苗（0.05）",
    ]
  },

    {
    group: "冰类",
    priority: 8,
    inputs: [
        "迷你冰川（2）",
        "融化的迷你冰川（3）",
        "大霜鲨附近的迷你冰川（2）",
        "大霜鲨俯冲攻击形成的冰（1）",
        "",
        "永冻企鹅（4）",
        "冰雕鱼（2）",
        "晶体独眼巨鹿（20）",
        "大霜鲨（18）",
        "WX-78（12）",
    ],
    outputs: [
        "冰（10）",
        "冬季盛宴节日欢愉（3）",
        "西瓜冰棍（1）",
        "香蕉冻（0.5）",
        "芦笋冷汤（0.5）"
    ]
  },

  {
    group: "猪人类",
    priority: 10,
    inputs: [
        "猪人（1）",
        "猪人守卫（2）",
        "月台疯猪（1.5）",
        "猪王（8）",
        "",
        "猪屋（2）",
        "姜饼猪屋（4）",
        "猪火炬（4）",
        "猪头（2）",
    ],
    outputs: [
        "猪皮（10）",
        "大肉（5）",
        "小肉（2）",
        "金腰带（0.5）",
        "排箫（0.05）",
    ]
  },
  // ……后面组同样结构
];
