// 灵枢织造箱生产组数据
window.LINGSHU_GROUPS = [
  {
    group: "树枝类",// 组名
    priority: 1,// 优先级
    inputs: [// 生产原料
      "多枝树2",
      "矮多枝树1",
      "普通多枝树2",
      "高大多枝树3",
      "老旧多枝树1",
      "多枝树坚果树苗0.5",
      "树苗1",
      "月树苗1.5"
    ],
    outputs: [// 生产结果
      "树枝10",
      "木头3",
      "木板2",
      "挖掘的树苗1",
      "挖掘的月树苗1"
    ]
  },


  {
    group: "木材类",
    priority: 4,
    inputs: [
        "常青树3",
        "矮常青树2",
        "普通常青树3",
        "高大常青树4",
        "老旧常青树2",
        "松果树苗1",
        "稀疏常青树1",
        "矮稀疏常青树1",
        "普通稀疏常青树1.5",
        "高大稀疏常青树2",
        "臃肿树苗0.25",
        "桦栗树2",
        "矮桦栗树1",
        "普通桦栗树2",
        "高大桦栗树3",
        "橡果树苗0.5",
        "月树3",
        "矮月树2",
        "普通月树3",
        "高大月树4.5",
        "月蝶树苗1.5",
        "沼泽树1",
    ],
    outputs: [
        "木头5",
        "木板2",
        "树枝1",
        "活木0.5",
        "浮木0.25",
    ]
  },


  {
    group: "棕榈类",
    priority: 10,
    inputs: [
        "棕榈树2",
        "矮棕榈树1",
        "普通棕榈树2",
        "高大棕榈树3",
        "棕榈果树苗0.5",
    ],
    outputs: [
        "木头4",
        "棕榈叶3",
        "洞穴香蕉1",
        "棕榈果种子1",
        "树枝1",
    ]
  },


  {
    group: "草类",
    priority: 2,
    inputs: [
        "草1",
        "芦苇3",
        "猴尾草4",
    ],
    outputs: [
        "割下的草10",
        "割下的芦苇3",
        "挖掘的草1",
        "挖掘的猴尾草0.5",
        "纸莎草纸0.25",
    ]
  },

    {
    group: "浆果类",
    priority: 3,
    inputs: [
        "普通浆果丛1",
        "另一种浆果丛1",
        "多汁浆果丛1.5",
    ],
    outputs: [
        "浆果10",
        "多汁浆果7",
        "熟浆果2",
        "熟多汁浆果1",
        "无花果1",
    ]
  },

    {
    group: "香蕉类",
    priority: 5,
    inputs: [
        "香蕉丛2",
        "洞穴香蕉树4",
    ],
    outputs: [
        "洞穴香蕉10",
        "熟洞穴香蕉3",
        "香蕉冰棒2",
        "挖掘的香蕉丛0.5",
        "挖掘的洞穴香蕉树(hmr)0.2",
    ]
  },

    {
    group: "鳄梨类",
    priority: 6,
    inputs: [
        "岩石鳄梨丛2",
        "农田鳄梨植株2",
    ],
    outputs: [
        "岩石鳄梨果实10",
        "成熟的岩石鳄梨果实3",
        "石头2",
        "熟成熟岩石鳄梨果实1",
        "岩石鳄梨果实幼苗0.2",
    ]
  },

    {
    group: "岩石类",
    priority: 6,
    inputs: [
        "普通岩石11",
        "普通岩石22",
        "无燧石岩石2",
        "中型无燧石岩石1",
        "小型无燧石岩石0.25",
        "月岩4",
        "月岩壳8",
        "石笋3",
        "完整石笋5",
        "中型石笋3",
        "小型石笋1",
        "高大石笋3",
        "完整高大石笋5",
        "中型高大石笋3",
        "小型高大石笋1",
        "洞穴崩塌巨石2",
        "石虾4",
    ],
    outputs: [
        "石头10",
        "燧石8",
        "硝石6",
        "金块6",
        "月岩碎块2",
    ]
  },

    {
    group: "大理石类",
    priority: 7,
    inputs: [
        "大理石树2",
        "大理石柱2.5",
        "竖琴雕像2.5",
        "麦斯威尔雕像4",
        "大理石雕像2.5",
        "大理石缪斯雕像2.5",
        "大理石卒雕像2.5",
        "骑士雕塑躯干2.5",
        "日行者石柱6",
        "复活石7",
        "高大大理石灌木1.25",
        "普通大理石灌木0.75",
        "矮大理石灌木0.5",
    ],
    outputs: [
        "大理石10",
        "切割石块3",
        "石头3",
        "大理石豆2",
        "古树宝石树苗物品0.05",
    ]
  },

    {
    group: "冰类",
    priority: 8,
    inputs: [
        "冰岩2",
        "低温冰岩3",
        "鲨鱼冰障2",
        "鲨鱼冰刺1",
        "变异企鹅4",
        "中型海鱼(8号)2",
        "变异巨鹿20",
        "鲨鱼男孩18",
        "WX78(机器人)12",
    ],
    outputs: [
        "冰10",
        "冬季盛宴燃料3",
        "西瓜冰棒1",
        "香蕉冰棒0.5",
        "西班牙冷汤0.5"
    ]
  },

    {
    group: "猪人类",
    priority: 10,
    inputs: [
        "猪人1",
        "猪守卫2",
        "月猪1.5",
        "猪王8",
        "猪房2",
        "姜饼屋4",
        "猪火炬4",
        "猪头2",
    ],
    outputs: [
        "猪皮10",
        "大肉5",
        "小肉2",
        "猪代币0.5",
        "排箫0.05",
    ]
  },
  // ……后面组同样结构
];
